from enum import Enum, unique


@unique
class Polarity(Enum):
    ABSTAIN = -1
    COMPANY = 0
    INDIVIDUAL = 1


SETTINGS = {
    "re_cmp": '公司|集团|有限|办事处|合作社',
    "keywords_indus": ['三方', '中介', '中心', '乐业', '五金', '交易', '交通', '交通运输', '产业', '产品', '产权', '产权交易', '人力', '人力资源',
                       '仓储', '会议', '会议展览', '传输', '传输服务', '住宿', '体育', '作业', '供应', '保险', '保险业', '保障', '信息',
                       '信息技术', '修业', '公共', '公司', '其他', '养殖', '养生', '农林', '农林牧', '农林牧渔', '冶炼', '出版', '出版社', '制作',
                       '制作业', '制品', '制品业', '制造', '制造业', '加工', '加工业', '化工', '化工产品', '医疗', '医药', '卫星', '卫生', '印刷',
                       '压延', '咨询', '咨询服务', '商务', '器材', '地产', '基金', '娱乐', '娱乐业', '婚庆', '安保', '安防', '审计', '家具',
                       '家政', '展览', '工业', '广告', '广告业', '广播', '广播电视', '建筑', '建筑业', '影院', '房地', '房地产', '房地产业',
                       '托车', '扩印', '批发', '技术', '摄影', '摩托', '摩托车', '支付', '教育', '文化', '文教', '新闻', '旅行', '旅行社', '服务',
                       '服务业', '服装', '木材', '殡葬', '水利', '汽车', '治理', '法律', '清洁', '烟草', '热力', '煤油', '燃气', '物业',
                       '物业管理', '玩具', '环境', '环境治理', '理发', '生产', '用品', '电信', '电力', '电器', '电子', '电子设备', '电影',
                       '电影院', '电池', '电缆', '电视', '相关', '知识', '知识产权', '研究', '社会', '社会保障', '种植', '科学', '科学研究',
                       '租赁', '租赁业', '空航', '第三方', '管理', '纸制', '纸制品', '纺织', '纺织业', '组织', '维修', '综合', '美容',
                       '自行车', '航天', '航空', '航空航天', '船舶', '行社', '行车', '装修', '装修业', '装饰', '设备', '证券', '货币', '资源',
                       '软件', '运输', '运输设备', '通运', '造纸', '邮政', '配件', '金属', '金属矿', '金融', '金融服务', '铁路', '零售', '零配件',
                       '非金属', '非金属矿', '食品', '食品饮料', '餐饮', '餐饮业', '饮料'],
    "re_surname": '王|李|张|刘|陈|杨|黄|吴|赵|周|徐|孙|马|朱|胡|林|郭|何|高|罗|郑|梁|谢|宋|唐|许|邓|冯|韩|曹|曾|彭|肖|蔡|潘|田|'
                  '董|袁|于|余|蒋|叶|杜|苏|魏|程|吕|丁|沈|任|姚|卢|钟|姜|崔|谭|廖|范|汪|陆|金|石|戴|贾|韦|夏|邱|方|侯|邹|熊|孟|'
                  '秦|白|毛|江|闫|薛|尹|付|段|雷|黎|史|龙|钱|贺|陶|顾|龚|郝|邵|万|严|洪|赖|武|傅|莫|孔|汤|向|常|温|康|施|文|牛|'
                  '樊|葛|邢|安|齐|易|乔|伍|庞|颜|倪|庄|聂|章|鲁|岳|翟|申|殷|詹|欧|耿|关|覃|兰|焦|俞|左|柳|甘|祝|包|代|宁|符|阮|'
                  '尚|舒|纪|柯|梅|童|毕|凌|单|季|成|霍|苗|裴|涂|谷|曲|盛|冉|翁|蓝|骆|路|游|靳|辛|欧阳|管|柴|蒙|鲍|华|喻|祁|房|'
                  '蒲|滕|萧|屈|饶|解|牟|艾|尤|时|阳|阎|穆|应|农|司|古|吉|卓|车|简|连|缪|项|麦|褚|窦|娄|戚|岑|党|宫|景|卜|费|冷|'
                  '晏|卫|席|柏|米|隋|宗|桂|瞿|全|苟|楼|闵|佟|臧|边|卞|姬|邬|和|师|仇|栾|丘|刁|沙|商|寇|荣|巫|郎|桑|丛|甄|敖|虞|'
                  '仲|池|巩|明|佘|查|麻|苑|迟|邝|封|官|谈|鞠|匡|惠|荆|乐|冀|胥|郁|南|班|储|芦|原|栗|燕|楚|鄢|扬|劳|谌|奚|皮|蔺|'
                  '粟|冼|盘|满|闻|厉|伊|候|仝|区|郜|海|阚|花|权|强|帅|屠|朴|盖|练|廉|禹|井|巴|漆|祖|丰|支|卿|国|狄|平|计|索|宣|'
                  '晋|相|占|初|门|云|容|敬|来|扈|晁|都|芮|普|阙|戈|浦|伏|薄|鹿|邸|雍|辜|阿|羊|母|亓|裘|修|邰|杭|赫|况|那|宿|鲜|'
                  '逯|印|隆|习|茹|诸|战|慕|危|玉|银|亢|公|嵇|豆|哈|湛|宾|勾|茅|戎|利|於|呼|居|干|揭|但|尉|斯|元|束|檀|衣|信|阴|'
                  '展|昝|智|幸|奉|植|富|衡|昌|巢|郦|逄|寿|由|竺|贝|步|东|鄂|弓|过|钮|濮|水|蔚|郗|荀|贲|别|邴|才|操|畅|从|达|凡|'
                  '凤|扶|贡|户|滑|郏|矫|经|靖|琚|巨|蒯|旷|历|励|伦|雒|茆|糜|宓|木|綦|谯|渠|山|生|侍|眭|腾|铁|宛|隗|沃|乌|毋|咸|'
                  '忻|续|延|言|尧|英|鱼|庾|招|种|訾|宝|保|暴|闭|布|藏|承|福|果|黑|怀|宦|回|汲|籍|蹇|将|可|里|粱|冒|么|年|泮|郄|'
                  '青|秋|释|双|税|潭|天|望|位|仵|香|刑|轩|玄|郇|要|宇|员|哀|爱|昂|熬|傲|奥|把|百|百里|摆|拜|邦|北|本|碧|薜|伯|'
                  '博|补|部|采|彩|菜|仓|苍|曽|茶|产|苌|倡|唱|钞|超|朝|潮|沉|晨|呈|赤|敕|崇|瘳|丑|除|楮|揣|传|春|淳|淳于|啜|慈|'
                  '次|爨|催|翠|寸|笪|答|丹|旦|淡|澹台|刀|道|德|迪|底|第|第五|佃|定|东方|冬|懂|钭|独孤|堵|端|端木|段干|敦|顿|多|'
                  '朵|恩|尔|佴|法|番|藩|芳|飞|斐|风|酆|逢|俸|苻|洑|浮|甫|府|复|淦|刚|皋|杲|格|庚|公孙|公西|公羊|公冶|恭|拱|供|'
                  '缑|菇|贯|冠|光|广|归|贵|呙|虢|还|寒|汉|行|蒿|好|昊|浩|禾|合|河|荷|赫连|恒|弘|红|宏|鸿|后|厚|呼延|忽|湖|虎|化|'
                  '淮|槐|环|桓|皇|皇甫|辉|会|火|伙|基|稽|及|戢|记|继|暨|加|佳|家|嘉|荚|甲|菅|翦|见|建|剑|降|娇|徼|缴|教|接|节|'
                  '杰|颉|介|京|静|酒|咎|菊|句|具|俱|剧|矍|军|君|俊|卡|开|凯|勘|堪|考|科|克|空|库|郐|奎|蒉|阔|喇|稂|朗|乐正|勒|'
                  '蕾|类|冷狐|梨|礼|理|力|立|丽|莲|良|疗|寥|列|吝|泠|零|另|令|令狐|刘付|刘傅|留|庐|炉|禄|洛|闾|闾丘|侣|律|绿|买|'
                  '曼|卯|枚|美|梦|弥|弭|秘|密|妙|闽|敏|名|谬|磨|墨|默|沐|牧|睦|慕容|纳|纳兰|娜|乃|南宫|南门|铙|能|尼|念|乜|甯|'
                  '殴阳|鸥|偶|攀|朋|蓬|澎|骈|濮阳|溥|柒|亓官|其|奇|祈|耆|千|乾|潜|羌|钦|琴|勤|清|庆|求|璩|却|荛|绕|仁|日|融|如|'
                  '汝|瑞|闰|润|若|撒|萨|赛|伞|森|厦|闪|陕|善|赏|上|上官|韶|卲|绍|厍|申屠|莘|神|甚|慎|升|绳|圣|诗|拾|矢|士|世|是|'
                  '守|首|殳|书|疏|树|顺|司空|司寇|司马|司徒|思|松|送|素|睢|随|所|锁|塔|台|太|太史|太叔|泰|郯|塘|桃|淘|藤|提|遆|'
                  '帖|通|同|徒|脱|陀|庹|拓|拓跋|完|完颜|万俟|旺|威|巍|伟|未|尉迟|闻人|问|瓮|巫马|无|吾|兀|西|西门|希|息|溪|袭|洗|'
                  '喜|霞|夏侯|夏候|仙|先|鲜于|贤|线|湘|象|宵|箫|潇|晓|孝|校|星|兴|雄|吁|须|顼|绪|轩辕|禤|学|雪|寻|牙|雅|焉|岩|'
                  '彦|艳|宴|洋|仰|养|样|幺|侥|药|冶|野|业|依|仪|夷|怡|宜|乙|蚁|弋|义|奕|羿|益|裔|翼|盈|营|永|勇|犹|油|友|有|迂|'
                  '宇文|羽|遇|誉|毓|源|远|院|月|悦|越|允|运|恽|载|宰|迮|增|甑|粘|斩|长|长孙|仉|掌|钊|兆|肇|折|真|阵|镇|征|正|政|'
                  '只|职|郅|治|中|忠|钟离|衷|仲孙|皱|邾|珠|诸葛|竹|主|颛孙|壮|禚|资|子|紫|自|字|宗政|纵|俎|左丘|佐'
}


def set_option(keyre, value):
    global SETTINGS

    if not keyre.startswith("keywords_") and not keyre.startswith("re_"):
        raise ValueError("必须以/'keywords_/'或/'re_/'开头")
    if keyre.startwith("keywords_") and not isinstance(value, list):
        raise ValueError("/'keywords/'的数据必须为列表")
    if keyre.startwith("keywords_") and not isinstance(value, list):
        raise ValueError("/'re/'的数据必须为字符串")

    if keyre in SETTINGS.keys():
        SETTINGS[keyre] += value
    SETTINGS[keyre] = value